<?php

$a = 10;
$b = 10;
$c = 10;
$d = "10";

echo "1. 기존 값 확인: a = 10, b = 10, c = 10, d = 10(양쪽에 쌍따옴표 있는 문자열)<br>";
echo "2. == 연산자로 a, b 값을 비교하면: ";
if ($a == $b) {
    echo "a와 b는 같습니다.<br>";
} else {
    echo "a와 b는 같지 않습니다.<br>";
}

echo "3. === 연산자로 c, d 값을 비교하면: ";
if ($c === $d) {
    echo "c와 d는 같습니다.<br>";
} else {
    echo "c와 d는 같지 않습니다.<br>";
}

echo "<br>4. != 연산자는 다르다(Not Equal)는 뜻이고, <> 연산자와 동일한 기능<br><br>";
echo "5. !== 연산자는 값 뿐만 아니라, 타입까지 다르다는 뜻<br><br>";
echo "6. >(초과), >=(이상), <(미만), <=(이하) 연산자도 존재<br><br>";